Show / Hide Table of Contents
Class RebarPoint3D
Represents a Point in 3D. Defines an Arc segment by radius.
Inheritance
System.Object
OpenObject
OpenElementId
Point3D
RebarPoint3D
Inherited Members
 Point3D.Name
 Point3D.X
 Point3D.Y
 Point3D.Z
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.RebarPoint3D,CI.StructuralElements", "CI.StructModel.Structure.IRebarPoint3D,CI.BasicTypes")]
public class RebarPoint3D : Point3D
Properties
Improve this Doc   View Source
BendRadius
Gets or sets the radius of the Arc
Declaration
public double BendRadius { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source